augment train data

augment train data

augment test data

Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv3d (Conv3D)              (None, 64, 64, 64, 16)    448       
_________________________________________________________________
activation (Activation)      (None, 64, 64, 64, 16)    0         
_________________________________________________________________
average_pooling3d (AveragePo (None, 32, 32, 32, 16)    0         
_________________________________________________________________
conv3d_1 (Conv3D)            (None, 32, 32, 32, 32)    13856     
_________________________________________________________________
activation_1 (Activation)    (None, 32, 32, 32, 32)    0         
_________________________________________________________________
average_pooling3d_1 (Average (None, 16, 16, 16, 32)    0         
_________________________________________________________________
conv3d_2 (Conv3D)            (None, 16, 16, 16, 64)    55360     
_________________________________________________________________
activation_2 (Activation)    (None, 16, 16, 16, 64)    0         
_________________________________________________________________
average_pooling3d_2 (Average (None, 8, 8, 8, 64)       0         
_________________________________________________________________
conv3d_3 (Conv3D)            (None, 8, 8, 8, 128)      221312    
_________________________________________________________________
activation_3 (Activation)    (None, 8, 8, 8, 128)      0         
_________________________________________________________________
average_pooling3d_3 (Average (None, 4, 4, 4, 128)      0         
_________________________________________________________________
conv3d_4 (Conv3D)            (None, 4, 4, 4, 256)      884992    
_________________________________________________________________
activation_4 (Activation)    (None, 4, 4, 4, 256)      0         
_________________________________________________________________
average_pooling3d_4 (Average (None, 2, 2, 2, 256)      0         
_________________________________________________________________
conv3d_5 (Conv3D)            (None, 2, 2, 2, 512)      3539456   
_________________________________________________________________
activation_5 (Activation)    (None, 2, 2, 2, 512)      0         
_________________________________________________________________
average_pooling3d_5 (Average (None, 1, 1, 1, 512)      0         
_________________________________________________________________
flatten (Flatten)            (None, 512)               0         
_________________________________________________________________
dense (Dense)                (None, 2048)              1050624   
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              2098176   
_________________________________________________________________
dense_2 (Dense)              (None, 5)                 5125      
=================================================================
Total params: 7,869,349
Trainable params: 7,869,349
Non-trainable params: 0
_________________________________________________________________

lr=1e-05
batchsize=20
epochs=1000
validation_split=0.1

totally cost:5460.152346134186

In test data,mae:0.012274891467818377,wmape:2.623365561716637,mse:0.00025737582171822917
In test data,mae:0.023659636733890814,wmape:5.056490835225804,mse:0.0014889801856962652
只镜像